Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH01/include/component/can.h
/* -------- CAN_TSCC : (CAN Offset: 0x20) (R/W 32) Timestamp Counter Configuration -------- */
#define CAN_TSCC_RESETVALUE                   _U_(0x00)                                            /**<  (CAN_TSCC) Timestamp Counter Configuration  Reset Value */

#define CAN_TSCC_TSS_Pos                      _U_(0)                                               /**< (CAN_TSCC) Timestamp Select Position */
#define CAN_TSCC_TSS_Msk                      (_U_(0x3) << CAN_TSCC_TSS_Pos)                       /**< (CAN_TSCC) Timestamp Select Mask */
#define CAN_TSCC_TSS(value)                   (CAN_TSCC_TSS_Msk & ((value) << CAN_TSCC_TSS_Pos))  
#define   CAN_TSCC_TSS_ZERO_Val               _U_(0x0)                                             /**< (CAN_TSCC) Timestamp counter value always 0x0000  */
#define   CAN_TSCC_TSS_INC_Val                _U_(0x1)                                             /**< (CAN_TSCC) Timestamp counter value incremented by TCP  */
#define CAN_TSCC_TSS_ZERO                     (CAN_TSCC_TSS_ZERO_Val << CAN_TSCC_TSS_Pos)          /**< (CAN_TSCC) Timestamp counter value always 0x0000 Position  */
#define CAN_TSCC_TSS_INC                      (CAN_TSCC_TSS_INC_Val << CAN_TSCC_TSS_Pos)           /**< (CAN_TSCC) Timestamp counter value incremented by TCP Position  */
#define CAN_TSCC_TCP_Pos                      _U_(16)                                              /**< (CAN_TSCC) Timestamp Counter Prescaler Position */
#define CAN_TSCC_TCP_Msk                      (_U_(0xF) << CAN_TSCC_TCP_Pos)                       /**< (CAN_TSCC) Timestamp Counter Prescaler Mask */
#define CAN_TSCC_TCP(value)                   (CAN_TSCC_TCP_Msk & ((value) << CAN_TSCC_TCP_Pos))  
#define CAN_TSCC_Msk                          _U_(0x000F0003)                                      /**< (CAN_TSCC) Register Mask  */


/* -------- CAN_TSCV : (CAN Offset: 0x24) ( R/ 32) Timestamp Counter Value -------- */
#define CAN_TSCV_RESETVALUE                   _U_(0x00)                                            /**<  (CAN_TSCV) Timestamp Counter Value  Reset Value */

#define CAN_TSCV_TSC_Pos                      _U_(0)                                               /**< (CAN_TSCV) Timestamp Counter Position */
#define CAN_TSCV_TSC_Msk                      (_U_(0xFFFF) << CAN_TSCV_TSC_Pos)                    /**< (CAN_TSCV) Timestamp Counter Mask */
#define CAN_TSCV_TSC(value)                   (CAN_TSCV_TSC_Msk & ((value) << CAN_TSCV_TSC_Pos))  
#define CAN_TSCV_Msk                          _U_(0x0000FFFF)                                      /**< (CAN_TSCV) Register Mask  */


/* -------- CAN_TOCC : (CAN Offset: 0x28) (R/W 32) Timeout Counter Configuration -------- */
#define CAN_TOCC_RESETVALUE                   _U_(0xFFFF0000)                                      /**<  (CAN_TOCC) Timeout Counter Configuration  Reset Value */

#define CAN_TOCC_ETOC_Pos                     _U_(0)                                               /**< (CAN_TOCC) Enable Timeout Counter Position */
#define CAN_TOCC_ETOC_Msk                     (_U_(0x1) << CAN_TOCC_ETOC_Pos)                      /**< (CAN_TOCC) Enable Timeout Counter Mask */
#define CAN_TOCC_ETOC(value)                  (CAN_TOCC_ETOC_Msk & ((value) << CAN_TOCC_ETOC_Pos))
#define CAN_TOCC_TOS_Pos                      _U_(1)                                               /**< (CAN_TOCC) Timeout Select Position */
#define CAN_TOCC_TOS_Msk                      (_U_(0x3) << CAN_TOCC_TOS_Pos)                       /**< (CAN_TOCC) Timeout Select Mask */
#define CAN_TOCC_TOS(value)                   (CAN_TOCC_TOS_Msk & ((value) << CAN_TOCC_TOS_Pos))  
#define   CAN_TOCC_TOS_CONT_Val               _U_(0x0)                                             /**< (CAN_TOCC) Continuout operation  */
#define   CAN_TOCC_TOS_TXEF_Val               _U_(0x1)                                             /**< (CAN_TOCC) Timeout controlled by TX Event FIFO  */
#define   CAN_TOCC_TOS_RXF0_Val               _U_(0x2)                                             /**< (CAN_TOCC) Timeout controlled by Rx FIFO 0  */
#define   CAN_TOCC_TOS_RXF1_Val               _U_(0x3)                                             /**< (CAN_TOCC) Timeout controlled by Rx FIFO 1  */
#define CAN_TOCC_TOS_CONT                     (CAN_TOCC_TOS_CONT_Val << CAN_TOCC_TOS_Pos)          /**< (CAN_TOCC) Continuout operation Position  */
#define CAN_TOCC_TOS_TXEF                     (CAN_TOCC_TOS_TXEF_Val << CAN_TOCC_TOS_Pos)          /**< (CAN_TOCC) Timeout controlled by TX Event FIFO Position  */
#define CAN_TOCC_TOS_RXF0                     (CAN_TOCC_TOS_RXF0_Val << CAN_TOCC_TOS_Pos)          /**< (CAN_TOCC) Timeout controlled by Rx FIFO 0 Position  */
#define CAN_TOCC_TOS_RXF1                     (CAN_TOCC_TOS_RXF1_Val << CAN_TOCC_TOS_Pos)          /**< (CAN_TOCC) Timeout controlled by Rx FIFO 1 Position  */
#define CAN_TOCC_TOP_Pos                      _U_(16)                                              /**< (CAN_TOCC) Timeout Period Position */
#define CAN_TOCC_TOP_Msk                      (_U_(0xFFFF) << CAN_TOCC_TOP_Pos)                    /**< (CAN_TOCC) Timeout Period Mask */
#define CAN_TOCC_TOP(value)                   (CAN_TOCC_TOP_Msk & ((value) << CAN_TOCC_TOP_Pos))  
#define CAN_TOCC_Msk                          _U_(0xFFFF0007)                                      /**< (CAN_TOCC) Register Mask  */


/* -------- CAN_TOCV : (CAN Offset: 0x2C) (R/W 32) Timeout Counter Value -------- */
#define CAN_TOCV_RESETVALUE                   _U_(0xFFFF)                                          /**<  (CAN_TOCV) Timeout Counter Value  Reset Value */

#define CAN_TOCV_TOC_Pos                      _U_(0)                                               /**< (CAN_TOCV) Timeout Counter Position */
#define CAN_TOCV_TOC_Msk                      (_U_(0xFFFF) << CAN_TOCV_TOC_Pos)                    /**< (CAN_TOCV) Timeout Counter Mask */
#define CAN_TOCV_TOC(value)                   (CAN_TOCV_TOC_Msk & ((value) << CAN_TOCV_TOC_Pos))  
#define CAN_TOCV_Msk                          _U_(0x0000FFFF)                                      /**< (CAN_TOCV) Register Mask  */


/* -------- CAN_ECR : (CAN Offset: 0x40) ( R/ 32) Error Counter -------- */
#define CAN_ECR_RESETVALUE                    _U_(0x00)                                            /**<  (CAN_ECR) Error Counter  Reset Value */

#define CAN_ECR_TEC_Pos                       _U_(0)                                               /**< (CAN_ECR) Transmit Error Counter Position */
#define CAN_ECR_TEC_Msk                       (_U_(0xFF) << CAN_ECR_TEC_Pos)                       /**< (CAN_ECR) Transmit Error Counter Mask */
#define CAN_ECR_TEC(value)                    (CAN_ECR_TEC_Msk & ((value) << CAN_ECR_TEC_Pos))    
#define CAN_ECR_REC_Pos                       _U_(8)                                               /**< (CAN_ECR) Receive Error Counter Position */
#define CAN_ECR_REC_Msk                       (_U_(0x7F) << CAN_ECR_REC_Pos)                       /**< (CAN_ECR) Receive Error Counter Mask */
#define CAN_ECR_REC(value)                    (CAN_ECR_REC_Msk & ((value) << CAN_ECR_REC_Pos))    
#define CAN_ECR_RP_Pos                        _U_(15)                                              /**< (CAN_ECR) Receive Error Passive Position */
#define CAN_ECR_RP_Msk                        (_U_(0x1) << CAN_ECR_RP_Pos)                         /**< (CAN_ECR) Receive Error Passive Mask */
#define CAN_ECR_RP(value)                     (CAN_ECR_RP_Msk & ((value) << CAN_ECR_RP_Pos))      
#define CAN_ECR_CEL_Pos                       _U_(16)                                              /**< (CAN_ECR) CAN Error Logging Position */
#define CAN_ECR_CEL_Msk                       (_U_(0xFF) << CAN_ECR_CEL_Pos)                       /**< (CAN_ECR) CAN Error Logging Mask */
#define CAN_ECR_CEL(value)                    (CAN_ECR_CEL_Msk & ((value) << CAN_ECR_CEL_Pos))    
#define CAN_ECR_Msk                           _U_(0x00FFFFFF)                                      /**< (CAN_ECR) Register Mask  */


/* -------- CAN_PSR : (CAN Offset: 0x44) ( R/ 32) Protocol Status -------- */
#define CAN_PSR_RESETVALUE                    _U_(0x707)                                           /**<  (CAN_PSR) Protocol Status  Reset Value */

#define CAN_PSR_LEC_Pos                       _U_(0)                                               /**< (CAN_PSR) Last Error Code Position */
#define CAN_PSR_LEC_Msk                       (_U_(0x7) << CAN_PSR_LEC_Pos)                        /**< (CAN_PSR) Last Error Code Mask */
#define CAN_PSR_LEC(value)                    (CAN_PSR_LEC_Msk & ((value) << CAN_PSR_LEC_Pos))    
#define   CAN_PSR_LEC_NONE_Val                _U_(0x0)                                             /**< (CAN_PSR) No Error  */
#define   CAN_PSR_LEC_STUFF_Val               _U_(0x1)                                             /**< (CAN_PSR) Stuff Error  */
#define   CAN_PSR_LEC_FORM_Val                _U_(0x2)                                             /**< (CAN_PSR) Form Error  */
#define   CAN_PSR_LEC_ACK_Val                 _U_(0x3)                                             /**< (CAN_PSR) Ack Error  */
#define   CAN_PSR_LEC_BIT1_Val                _U_(0x4)                                             /**< (CAN_PSR) Bit1 Error  */
#define   CAN_PSR_LEC_BIT0_Val                _U_(0x5)                                             /**< (CAN_PSR) Bit0 Error  */
#define   CAN_PSR_LEC_CRC_Val                 _U_(0x6)                                             /**< (CAN_PSR) CRC Error  */
#define   CAN_PSR_LEC_NC_Val                  _U_(0x7)                                             /**< (CAN_PSR) No Change  */
#define CAN_PSR_LEC_NONE                      (CAN_PSR_LEC_NONE_Val << CAN_PSR_LEC_Pos)            /**< (CAN_PSR) No Error Position  */
#define CAN_PSR_LEC_STUFF                     (CAN_PSR_LEC_STUFF_Val << CAN_PSR_LEC_Pos)           /**< (CAN_PSR) Stuff Error Position  */
#define CAN_PSR_LEC_FORM                      (CAN_PSR_LEC_FORM_Val << CAN_PSR_LEC_Pos)            /**< (CAN_PSR) Form Error Position  */
#define CAN_PSR_LEC_ACK                       (CAN_PSR_LEC_ACK_Val << CAN_PSR_LEC_Pos)             /**< (CAN_PSR) Ack Error Position  */
#define CAN_PSR_LEC_BIT1                      (CAN_PSR_LEC_BIT1_Val << CAN_PSR_LEC_Pos)            /**< (CAN_PSR) Bit1 Error Position  */
#define CAN_PSR_LEC_BIT0                      (CAN_PSR_LEC_BIT0_Val << CAN_PSR_LEC_Pos)            /**< (CAN_PSR) Bit0 Error Position  */
#define CAN_PSR_LEC_CRC                       (CAN_PSR_LEC_CRC_Val << CAN_PSR_LEC_Pos)             /**< (CAN_PSR) CRC Error Position  */
#define CAN_PSR_LEC_NC                        (CAN_PSR_LEC_NC_Val << CAN_PSR_LEC_Pos)              /**< (CAN_PSR) No Change Position  */
#define CAN_PSR_ACT_Pos                       _U_(3)                                               /**< (CAN_PSR) Activity Position */
#define CAN_PSR_ACT_Msk                       (_U_(0x3) << CAN_PSR_ACT_Pos)                        /**< (CAN_PSR) Activity Mask */
#define CAN_PSR_ACT(value)                    (CAN_PSR_ACT_Msk & ((value) << CAN_PSR_ACT_Pos))    
#define   CAN_PSR_ACT_SYNC_Val                _U_(0x0)                                             /**< (CAN_PSR) Node is synchronizing on CAN communication  */
#define   CAN_PSR_ACT_IDLE_Val                _U_(0x1)                                             /**< (CAN_PSR) Node is neither receiver nor transmitter  */
#define   CAN_PSR_ACT_RX_Val                  _U_(0x2)                                             /**< (CAN_PSR) Node is operating as receiver  */
#define   CAN_PSR_ACT_TX_Val                  _U_(0x3)                                             /**< (CAN_PSR) Node is operating as transmitter  */
#define CAN_PSR_ACT_SYNC                      (CAN_PSR_ACT_SYNC_Val << CAN_PSR_ACT_Pos)            /**< (CAN_PSR) Node is synchronizing on CAN communication Position  */
#define CAN_PSR_ACT_IDLE                      (CAN_PSR_ACT_IDLE_Val << CAN_PSR_ACT_Pos)            /**< (CAN_PSR) Node is neither receiver nor transmitter Position  */
#define CAN_PSR_ACT_RX                        (CAN_PSR_ACT_RX_Val << CAN_PSR_ACT_Pos)              /**< (CAN_PSR) Node is operating as receiver Position  */
#define CAN_PSR_ACT_TX                        (CAN_PSR_ACT_TX_Val << CAN_PSR_ACT_Pos)              /**< (CAN_PSR) Node is operating as transmitter Position  */
#define CAN_PSR_EP_Pos                        _U_(5)                                               /**< (CAN_PSR) Error Passive Position */
#define CAN_PSR_EP_Msk                        (_U_(0x1) << CAN_PSR_EP_Pos)                         /**< (CAN_PSR) Error Passive Mask */
#define CAN_PSR_EP(value)                     (CAN_PSR_EP_Msk & ((value) << CAN_PSR_EP_Pos))      
#define CAN_PSR_EW_Pos                        _U_(6)                                               /**< (CAN_PSR) Warning Status Position */
#define CAN_PSR_EW_Msk                        (_U_(0x1) << CAN_PSR_EW_Pos)                         /**< (CAN_PSR) Warning Status Mask */
#define CAN_PSR_EW(value)                     (CAN_PSR_EW_Msk & ((value) << CAN_PSR_EW_Pos))      
#define CAN_PSR_BO_Pos                        _U_(7)                                               /**< (CAN_PSR) Bus_Off Status Position */
#define CAN_PSR_BO_Msk                        (_U_(0x1) << CAN_PSR_BO_Pos)                         /**< (CAN_PSR) Bus_Off Status Mask */
#define CAN_PSR_BO(value)                     (CAN_PSR_BO_Msk & ((value) << CAN_PSR_BO_Pos))      
#define CAN_PSR_DLEC_Pos                      _U_(8)                                               /**< (CAN_PSR) Data Phase Last Error Code Position */
#define CAN_PSR_DLEC_Msk                      (_U_(0x7) << CAN_PSR_DLEC_Pos)                       /**< (CAN_PSR) Data Phase Last Error Code Mask */
#define CAN_PSR_DLEC(value)                   (CAN_PSR_DLEC_Msk & ((value) << CAN_PSR_DLEC_Pos))  
#define   CAN_PSR_DLEC_NONE_Val               _U_(0x0)                                             /**< (CAN_PSR) No Error  */
#define   CAN_PSR_DLEC_STUFF_Val              _U_(0x1)                                             /**< (CAN_PSR) Stuff Error  */
#define   CAN_PSR_DLEC_FORM_Val               _U_(0x2)                                             /**< (CAN_PSR) Form Error  */
#define   CAN_PSR_DLEC_ACK_Val                _U_(0x3)                                             /**< (CAN_PSR) Ack Error  */
#define   CAN_PSR_DLEC_BIT1_Val               _U_(0x4)                                             /**< (CAN_PSR) Bit1 Error  */
#define   CAN_PSR_DLEC_BIT0_Val               _U_(0x5)                                             /**< (CAN_PSR) Bit0 Error  */
#define   CAN_PSR_DLEC_CRC_Val                _U_(0x6)                                             /**< (CAN_PSR) CRC Error  */
#define   CAN_PSR_DLEC_NC_Val                 _U_(0x7)                                             /**< (CAN_PSR) No Change  */
#define CAN_PSR_DLEC_NONE                     (CAN_PSR_DLEC_NONE_Val << CAN_PSR_DLEC_Pos)          /**< (CAN_PSR) No Error Position  */
#define CAN_PSR_DLEC_STUFF                    (CAN_PSR_DLEC_STUFF_Val << CAN_PSR_DLEC_Pos)         /**< (CAN_PSR) Stuff Error Position  */
#define CAN_PSR_DLEC_FORM                     (CAN_PSR_DLEC_FORM_Val << CAN_PSR_DLEC_Pos)          /**< (CAN_PSR) Form Error Position  */
#define CAN_PSR_DLEC_ACK                      (CAN_PSR_DLEC_ACK_Val << CAN_PSR_DLEC_Pos)           /**< (CAN_PSR) Ack Error Position  */
#define CAN_PSR_DLEC_BIT1                     (CAN_PSR_DLEC_BIT1_Val << CAN_PSR_DLEC_Pos)          /**< (CAN_PSR) Bit1 Error Position  */
#define CAN_PSR_DLEC_BIT0                     (CAN_PSR_DLEC_BIT0_Val << CAN_PSR_DLEC_Pos)          /**< (CAN_PSR) Bit0 Error Position  */
#define CAN_PSR_DLEC_CRC                      (CAN_PSR_DLEC_CRC_Val << CAN_PSR_DLEC_Pos)           /**< (CAN_PSR) CRC Error Position  */
#define CAN_PSR_DLEC_NC                       (CAN_PSR_DLEC_NC_Val << CAN_PSR_DLEC_Pos)            /**< (CAN_PSR) No Change Position  */
#define CAN_PSR_RESI_Pos                      _U_(11)                                              /**< (CAN_PSR) ESI flag of last received CAN FD Message Position */
#define CAN_PSR_RESI_Msk                      (_U_(0x1) << CAN_PSR_RESI_Pos)                       /**< (CAN_PSR) ESI flag of last received CAN FD Message Mask */
#define CAN_PSR_RESI(value)                   (CAN_PSR_RESI_Msk & ((value) << CAN_PSR_RESI_Pos))  
#define CAN_PSR_RBRS_Pos                      _U_(12)                                              /**< (CAN_PSR) BRS flag of last received CAN FD Message Position */
#define CAN_PSR_RBRS_Msk                      (_U_(0x1) << CAN_PSR_RBRS_Pos)                       /**< (CAN_PSR) BRS flag of last received CAN FD Message Mask */
#define CAN_PSR_RBRS(value)                   (CAN_PSR_RBRS_Msk & ((value) << CAN_PSR_RBRS_Pos))  
#define CAN_PSR_RFDF_Pos                      _U_(13)                                              /**< (CAN_PSR) Received a CAN FD Message Position */
#define CAN_PSR_RFDF_Msk                      (_U_(0x1) << CAN_PSR_RFDF_Pos)                       /**< (CAN_PSR) Received a CAN FD Message Mask */
#define CAN_PSR_RFDF(value)                   (CAN_PSR_RFDF_Msk & ((value) << CAN_PSR_RFDF_Pos))  
#define CAN_PSR_PXE_Pos                       _U_(14)                                              /**< (CAN_PSR) Protocol Exception Event Position */
#define CAN_PSR_PXE_Msk                       (_U_(0x1) << CAN_PSR_PXE_Pos)                        /**< (CAN_PSR) Protocol Exception Event Mask */
#define CAN_PSR_PXE(value)                    (CAN_PSR_PXE_Msk & ((value) << CAN_PSR_PXE_Pos))    
#define CAN_PSR_TDCV_Pos                      _U_(16)                                              /**< (CAN_PSR) Transmitter Delay Compensation Value Position */
#define CAN_PSR_TDCV_Msk                      (_U_(0x7F) << CAN_PSR_TDCV_Pos)                      /**< (CAN_PSR) Transmitter Delay Compensation Value Mask */
#define CAN_PSR_TDCV(value)                   (CAN_PSR_TDCV_Msk & ((value) << CAN_PSR_TDCV_Pos))  
#define CAN_PSR_Msk                           _U_(0x007F7FFF)                                      /**< (CAN_PSR) Register Mask  */


/* -------- CAN_TDCR : (CAN Offset: 0x48) (R/W 32) Extended ID Filter Configuration -------- */
#define CAN_TDCR_RESETVALUE                   _U_(0x00)                                            /**<  (CAN_TDCR) Extended ID Filter Configuration  Reset Value */

